emacs.org
#+TITLE: Emacs Literate Configuration
#+PROPERTY: header-args :tangle yes

* Configuration
:PROPERTIES:
:VISIBILITY: children
:END:
** About this file
This is an Emacs literate configuration template. It contains the basic structure
of a literate config along with some optimizations to ensure a fast load time.

** Org File Tweaks
There are a few tweaks included in this org file that make it a little easier to
work with.

*** Automatically Tangle
First there is a property defined on the file:

#+BEGIN_SRC :tangle no
header-args :tangle yes
#+END_SRC

This tells emacs to automatically tangle (include) all code blocks in this file when
generating the code for the config, unless the code block explicitly includes
=:tangle no= as the above code block does.

*** Visibility Settings
Next we have a property defined on the [[Configuration][Configuration]] heading that defines the visibility
that tells org to show it's direct children on startup. This way a clean outline of all
sub headings under Configuration is shown each time this file is opened in org-mode.

** Personal Information
Let's set some variables with basic user information.

#+BEGIN_SRC emacs-lisp
(setq user-full-name "Your Name Here"
      user-mail-address "user@email.com")
#+END_SRC
** Sane Defaults
   #+BEGIN_SRC emacs-lisp
     (setq make-backup-files nil)
     (setq backup-directory-alist `((".*" . "~/.saves")))

     (setq backup-by-copying t)
     (setq delete-old-versions t
       kept-new-versions 6
       kept-old-versions 2
       version-control t)


     (setq sentence-end-double-space nil)
     (setq fill-column (1- (window-width)))

     (setq scroll-conservatively 101
           ispell-program-name "aspell")

     (set-language-environment "UTF-8")
     (set-default-coding-systems 'utf-8)
     (setq-default indent-tabs-mode nil)
     (global-auto-revert-mode t)
     (global-hl-line-mode 1)
     (menu-bar-mode -1)
     (scroll-bar-mode -1)
     (tool-bar-mode -1)
     (blink-cursor-mode 0)
     (winner-mode 1)
     (visual-line-mode 1)
     (put 'narrow-to-region 'disabled nil)
     (add-hook 'text-mode-hook 'auto-fill-mode)




     (defalias 'yes-or-no-p 'y-or-n-p) ; remplace yes no par y n

     (setq custom-safe-themes t)

     (setq save-interprogram-paste-before-kill t)

     (save-place-mode)    ; save cursor position between sessions

     (setq help-window-select t)                  ; focus help window when opene

     (defun switch-to-scratch-buffer ()
       "Switch to the `*scratch*' buffer. Create it first if needed."
       (interactive)
       (let ((exists (get-buffer "*scratch*")))
         (switch-to-buffer (get-buffer-create "*scratch*"))
         (when (and (not exists)
                    (not (eq major-mode 'org-mode))
                    (fboundp 'org-mode))
           (funcall 'org-mode))))

     (setq ad-redefinition-action 'accept)

(setq initial-scratch-message "")
(setq initial-buffer-choice t)
(setq initial-major-mode 'org-mode)

   #+END_SRC

** Emacs Initialization
*** Settings
We're going to increase the gc-cons-threshold to a very high number to decrease the load and compile time.
We'll lower this value significantly after initialization has completed. We don't want to keep this value
too high or it will result in long GC pauses during normal usage.

#+BEGIN_SRC emacs-lisp
(eval-and-compile
  (setq gc-cons-threshold 402653184
        gc-cons-percentage 0.6))
#+END_SRC

Disable certain byte compiler warnings to cut down on the noise. This is a personal choice and can be removed
if you would like to see any and all byte compiler warnings.

#+BEGIN_SRC emacs-lisp
(setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
#+END_SRC

*** Package Management
**** Package Settings
We're going to set the =load-path= ourselves and avoid calling =(package-initilize)= (for
performance reasons) so we need to set =package--init-file-ensured= to true to tell =package.el=
to not automatically call it on our behalf. Additionally we're setting
=package-enable-at-startup= to nil so that packages will not automatically be loaded for us since
=use-package= will be handling that.

#+BEGIN_SRC emacs-lisp
  (eval-and-compile
    (setq load-prefer-newer t
          package-user-dir "~/.emacs.d/elpa"
          package--init-file-ensured t
          package-enable-at-startup nil)

    (unless (file-directory-p package-user-dir)
      (make-directory package-user-dir t)))
#+END_SRC

**** Use-Package Settings
Tell =use-package= to always defer loading packages unless explicitly told otherwise. This speeds up
initialization significantly as many packages are only loaded later when they are explicitly used.

#+BEGIN_SRC emacs-lisp
  (setq use-package-always-defer t
        use-package-verbose t)
#+END_SRC

**** Manually Set Load Path
We're going to set the load path ourselves so that we don't have to call =package-initialize= at
runtime and incur a large performance hit. This load-path will actually be faster than the one
created by =package-initialize= because it appends the elpa packages to the end of the load path.
Otherwise any time a builtin package was required it would have to search all of third party paths
first.

#+BEGIN_SRC emacs-lisp
  (eval-and-compile
    (setq load-path (append load-path (directory-files package-user-dir t "^[^.]" t))))
#+END_SRC

**** Initialize Package Management
Next we are going to require =package.el= and add our additional package archives, 'melpa' and 'org'.
Afterwards we need to initialize our packages and then ensure that =use-package= is installed, which
we promptly install if it's missing. Finally we load =use-package= and tell it to always install any
missing packages.

Note that this entire block is wrapped in =eval-when-compile=. The effect of this is to perform all
of the package initialization during compilation so that when byte compiled, all of this time consuming
code is skipped. This can be done because the result of byte compiling =use-package= statements results
in the macro being fully expanded at which point =use-package= isn't actually required any longer.

Since the code is automatically compiled during runtime, if the configuration hasn't already been
previously compiled manually then all of the package initialization will still take place at startup.

#+BEGIN_SRC emacs-lisp
  (eval-when-compile
    (require 'package)

    (unless (assoc-default "melpa" package-archives)
      (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t))
    (unless (assoc-default "org" package-archives)
      (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t))

    (package-initialize)
    (unless (package-installed-p 'use-package)
      (package-refresh-contents)
      (package-install 'use-package))
    (require 'use-package)
    (setq use-package-always-ensure t))
#+END_SRC

* Packages
** Which-Key
which-key is a minor mode for Emacs that displays the key bindings following your currently entered incomplete command (a prefix) in a popup. For example, after enabling the minor mode if you enter C-x and wait for the default of 1 second the minibuffer will expand with all of the available key bindings that follow C-x (or as many as space allows given your settings). 
https://github.com/justbur/emacs-which-key
   #+BEGIN_SRC emacs-lisp
 (use-package which-key
   :init
   (setq which-key-sort-order 'which-key-prefix-then-key-order)
   (setq which-key-popup-type 'side-window
         which-key-side-window-max-height 0.3
         which-key-side-window-max-width 0.5
         which-key-idle-delay 0.0
         which-key-min-display-lines 8)
   :config
   (which-key-mode 1)
   (which-key-setup-side-window-bottom))
   #+END_SRC

** General
general.el provides a more convenient method for binding keys in emacs
it's primary purpose is to build on existing functionality to make key definition more clear and concise.

https://github.com/noctuid/general.el
   #+BEGIN_SRC emacs-lisp
(use-package general
  :config
  (general-override-mode 1))

(general-define-key
 :keymaps 'key-translation-map
 "ESC" (kbd "C-g"))


(general-create-definer tyrant-def
  :states '(normal visual insert motion emacs)
  :prefix "SPC"
  :non-normal-prefix "C-SPC")


(general-create-definer despot-def
  :states '(normal insert)
  :prefix "SPC"
  :non-normal-prefix "C-SPC")


(general-def
  "C-x x" 'eval-defun)

(tyrant-def

  ""     nil
  "c"   (general-simulate-key "C-c")
  "h"   (general-simulate-key "C-h")
  "u"   (general-simulate-key "C-u")
  "x"   (general-simulate-key "C-x")

  "TAB"   'switch-to-previous-buffer

   ;; Theme operations
   "t"   '(:ignore t :which-key "themes")

   ;; Quit operations
   "q"	  '(:ignore t :which-key "quit emacs")
   "qq"  'kill-emacs
   "qz"  'delete-frame


   ;; Buffer operations
   "b"   '(:ignore t :which-key "buffer")
   "bb"  'mode-line-other-buffer
   "bd"  'kill-this-buffer
   "b]"  'next-buffer
   "b["  'previous-buffer
   "bq"  'kill-buffer-and-window
   "bR"  'rename-file-and-buffer
   "br"  'revert-buffer

   ;; Window operations
   "w"   '(:ignore t :which-key "window")
   "wm"  'maximize-window
   "w/"  'split-window-horizontally
   "wv"  'split-window-vertically
   "wm"  'maximize-window
   "wu"  'winner-undo
   "ww"  'other-window
   "wd"  'delete-window
   "wD"  'delete-other-windows

   ;; File operations
   "f"   '(:ignore t :which-key "files")
   "fc"  'write-file
   "fe"  '(:ignore t :which-key "emacs")
   "fj"  'dired-jump
   "fl"  'find-file-literally
   "fR"  'rename-file-and-buffer
   "fs"  'save-buffer

   ;; Applications
   "a"   '(:ignore t :which-key "applications")
   "ad"  'dired
   ":"   'shell-command
   ";"   'eval-expression
   "ac"  'calendar
   "oa"  'org-agenda)


      (tyrant-def
       "SPC" 'helm-M-x
       "bm"  'helm-mini
       "ff"  'helm-find-files
       "fr"  'helm-recentf
       "fL"  'helm-locate)

      (tyrant-def
       "p"   '(:ignore t :which-key "projectile")
       "pd"  'helm-projectile-dired-find-dir
       "po"  'helm-projectile-find-other-file
       "pf"  'helm-projectile-find-file
       "fp"  'helm-projectile-find-file
       "pb"  'helm-projectile-switch-to-buffer
       "bp"  'helm-projectile-switch-to-buffer)



   #+END_SRC

