emacs.el
(setq user-full-name "Your Name Here"
      user-mail-address "user@email.com")

(setq make-backup-files nil)
     (setq backup-directory-alist `((".*" . "~/.saves")))

     (setq backup-by-copying t)
     (setq delete-old-versions t
       kept-new-versions 6
       kept-old-versions 2
       version-control t)


     (setq sentence-end-double-space nil)
     (setq fill-column (1- (window-width)))

     (setq scroll-conservatively 101
           ispell-program-name "aspell")

     (set-language-environment "UTF-8")
     (set-default-coding-systems 'utf-8)
     (setq-default indent-tabs-mode nil)
     (global-auto-revert-mode t)
     (global-hl-line-mode 1)
     (menu-bar-mode -1)
     (scroll-bar-mode -1)
     (tool-bar-mode -1)
     (blink-cursor-mode 0)
     (winner-mode 1)
     (visual-line-mode 1)
     (put 'narrow-to-region 'disabled nil)
     (add-hook 'text-mode-hook 'auto-fill-mode)




     (defalias 'yes-or-no-p 'y-or-n-p) ; remplace yes no par y n

     (setq custom-safe-themes t)

     (setq save-interprogram-paste-before-kill t)

     (save-place-mode)    ; save cursor position between sessions

     (setq help-window-select t)                  ; focus help window when opene

     (defun switch-to-scratch-buffer ()
       "Switch to the `*scratch*' buffer. Create it first if needed."
       (interactive)
       (let ((exists (get-buffer "*scratch*")))
         (switch-to-buffer (get-buffer-create "*scratch*"))
         (when (and (not exists)
                    (not (eq major-mode 'org-mode))
                    (fboundp 'org-mode))
           (funcall 'org-mode))))

     (setq ad-redefinition-action 'accept)

(setq initial-scratch-message "")
(setq initial-buffer-choice t)
(setq initial-major-mode 'org-mode)

(eval-and-compile
  (setq gc-cons-threshold 402653184
        gc-cons-percentage 0.6))

(setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))

(eval-and-compile
  (setq load-prefer-newer t
        package-user-dir "~/.emacs.d/elpa"
        package--init-file-ensured t
        package-enable-at-startup nil)

  (unless (file-directory-p package-user-dir)
    (make-directory package-user-dir t)))

(setq use-package-always-defer t
      use-package-verbose t)

(eval-and-compile
  (setq load-path (append load-path (directory-files package-user-dir t "^[^.]" t))))

(eval-when-compile
  (require 'package)

  (unless (assoc-default "melpa" package-archives)
    (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t))
  (unless (assoc-default "org" package-archives)
    (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t))

  (package-initialize)
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (require 'use-package)
  (setq use-package-always-ensure t))

(use-package which-key
  :init
  (setq which-key-sort-order 'which-key-prefix-then-key-order)
  (setq which-key-popup-type 'side-window
        which-key-side-window-max-height 0.3
        which-key-side-window-max-width 0.5
        which-key-idle-delay 0.0
        which-key-min-display-lines 8)
  :config
  (which-key-mode 1)
  (which-key-setup-side-window-bottom))

(use-package general
  :config
  (general-override-mode 1))

(general-define-key
 :keymaps 'key-translation-map
 "ESC" (kbd "C-g"))


(general-create-definer tyrant-def
  :states '(normal visual insert motion emacs)
  :prefix "SPC"
  :non-normal-prefix "C-SPC")


(general-create-definer despot-def
  :states '(normal insert)
  :prefix "SPC"
  :non-normal-prefix "C-SPC")


(general-def
  "C-x x" 'eval-defun)

(tyrant-def

  ""     nil
  "c"   (general-simulate-key "C-c")
  "h"   (general-simulate-key "C-h")
  "u"   (general-simulate-key "C-u")
  "x"   (general-simulate-key "C-x")

  "TAB"   'switch-to-previous-buffer

   ;; Theme operations
   "t"   '(:ignore t :which-key "themes")

   ;; Quit operations
   "q"	  '(:ignore t :which-key "quit emacs")
   "qq"  'kill-emacs
   "qz"  'delete-frame


   ;; Buffer operations
   "b"   '(:ignore t :which-key "buffer")
   "bb"  'mode-line-other-buffer
   "bd"  'kill-this-buffer
   "b]"  'next-buffer
   "b["  'previous-buffer
   "bq"  'kill-buffer-and-window
   "bR"  'rename-file-and-buffer
   "br"  'revert-buffer

   ;; Window operations
   "w"   '(:ignore t :which-key "window")
   "wm"  'maximize-window
   "w/"  'split-window-horizontally
   "wv"  'split-window-vertically
   "wm"  'maximize-window
   "wu"  'winner-undo
   "ww"  'other-window
   "wd"  'delete-window
   "wD"  'delete-other-windows

   ;; File operations
   "f"   '(:ignore t :which-key "files")
   "fc"  'write-file
   "fe"  '(:ignore t :which-key "emacs")
   "fj"  'dired-jump
   "fl"  'find-file-literally
   "fR"  'rename-file-and-buffer
   "fs"  'save-buffer

   ;; Applications
   "a"   '(:ignore t :which-key "applications")
   "ad"  'dired
   ":"   'shell-command
   ";"   'eval-expression
   "ac"  'calendar
   "oa"  'org-agenda)


      (tyrant-def
       "SPC" 'helm-M-x
       "bm"  'helm-mini
       "ff"  'helm-find-files
       "fr"  'helm-recentf
       "fL"  'helm-locate)

      (tyrant-def
       "p"   '(:ignore t :which-key "projectile")
       "pd"  'helm-projectile-dired-find-dir
       "po"  'helm-projectile-find-other-file
       "pf"  'helm-projectile-find-file
       "fp"  'helm-projectile-find-file
       "pb"  'helm-projectile-switch-to-buffer
       "bp"  'helm-projectile-switch-to-buffer)

(use-package helm
