emacs.org
** Helm
Helm is an incremental completion and selection narrowing framework for Emacs. It will help steer you in the right direction when you're looking for stuff in Emacs (like buffers, files, etc).
http://tuhdo.github.io/helm-intro.html

#+BEGIN_SRC emacs-lisp
    (use-package helm
      :hook (after-init . helm-autoresize-mode)
      :config (require 'helm-config)
      :commands (helm-mini
                 helm-find-files
                 helm-recentf
                 helm-locate
                 helm-M-x
                 helm-flyspell-correct))

    (use-package helm-flyspell
      :commands (helm-flyspell-correct))

    (use-package helm-projectile
      :after (projectile helm))

  (global-set-key (kbd "M-x") 'helm-M-x)
  (global-set-key (kbd "C-x r b") #'helm-filtered-bookmarks)
  (global-set-key (kbd "C-x C-f") #'helm-find-files)



#+END_SRC

** helm-swoop
Install the helm-swoop package. This is an advanced grep package. You can search the current file, multiple buffers, etc.

#+BEGIN_SRC emacs-lisp
(use-package helm-swoop
  :ensure t
  :init
  (progn
    (setq helm-swoop-speed-or-color t)
    (global-set-key (kbd "C-s") 'helm-swoop)
    ))
#+END_SRC
** Projectile
Projectile is a quick and easy project management package that "just works". We're
going to install it and make sure it's loaded immediately.

https://www.projectile.mx/en/latest/
#+BEGIN_SRC emacs-lisp
(use-package projectile
  :demand t)
#+END_SRC

** Org
Org mode is for keeping notes, maintaining TODO lists, planning projects, and authoring documents with a fast and effective plain-text system.
https://orgmode.org/
#+BEGIN_SRC emacs-lisp
(use-package org
  :ensure org-plus-contrib
  :pin org)

;; Ensure ELPA org is prioritized above built-in org.
(require 'cl)
(setq load-path (remove-if (lambda (x) (string-match-p "org$" x)) load-path))
#+END_SRC
