emacs.el
    :hook (after-init . helm-autoresize-mode)
    :config (require 'helm-config)
    :commands (helm-mini
               helm-find-files
               helm-recentf
               helm-locate
               helm-M-x
               helm-flyspell-correct))

  (use-package helm-flyspell
    :commands (helm-flyspell-correct))

  (use-package helm-projectile
    :after (projectile helm))

(global-set-key (kbd "M-x") 'helm-M-x)
(global-set-key (kbd "C-x r b") #'helm-filtered-bookmarks)
(global-set-key (kbd "C-x C-f") #'helm-find-files)

(use-package helm-swoop
  :ensure t
  :init
  (progn
    (setq helm-swoop-speed-or-color t)
    (global-set-key (kbd "C-s") 'helm-swoop)
    ))

(use-package projectile
  :demand t)

(use-package org
  :ensure org-plus-contrib
  :pin org)

;; Ensure ELPA org is prioritized above built-in org.
(require 'cl)
(setq load-path (remove-if (lambda (x) (string-match-p "org$" x)) load-path))
