emacs.el
  :hook (after-init . evil-mode)
  :config
  (evil-set-initial-state 'shell-mode 'normal)
  (evil-set-initial-state 'doc-view-mode 'normal)
  (evil-set-initial-state 'deft-mode 'emacs)
  (evil-set-initial-state 'notdeft-mode 'emacs)
  (evil-set-initial-state 'package-menu-mode 'normal)
  (evil-set-initial-state 'pdf-view-mode 'normal)
  (evil-set-initial-state 'pdf-outline-buffer-mode 'normal)
  (evil-set-initial-state 'pdf-outline-buffer-mode 'normal)

  (add-hook 'org-capture-mode-hook 'evil-emacs-state)


  (define-key evil-normal-state-map (kbd "q") nil)

  (define-key evil-insert-state-map (kbd "C-e") nil)
  (define-key evil-insert-state-map (kbd "C-d") nil)
  (define-key evil-insert-state-map (kbd "C-k") nil)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-visual-state-map (kbd "C-c") 'evil-normal-state)

  (define-key evil-motion-state-map (kbd "C-e") nil)
  (define-key evil-visual-state-map (kbd "C-c") 'evil-exit-visual-state)

  (define-key evil-normal-state-map (kbd "RET") 'narrow-or-widen-dwim)


  (setq doc-view-continuous t))

(use-package evil-org
  :after evil)

(use-package telephone-line
  :config
  (telephone-line-defsegment my-vc-info ()
    (when vc-mode
      (cond
       ((string-match "Git[:-]" vc-mode)
        (let ((branch (mapconcat 'concat (cdr (split-string vc-mode "[:-]")) "-")))
          (concat "" (format " %s" branch))))
       ((string-match "SVN-" vc-mode)
        (let ((revision (cadr (split-string vc-mode "-"))))
          (concat "" (format "SVN-%s" revision))))
       (t (format "%s" vc-mode)))))

  (setq telephone-line-lhs
        '((evil   . (telephone-line-evil-tag-segment))
          (accent . (my-vc-info
                     telephone-line-process-segment))
          (nil    . (telephone-line-buffer-segment
                     telephone-line-projectile-segment))))

  (setq telephone-line-rhs
        '((nil    . (telephone-line-flycheck-segment
                     telephone-line-misc-info-segment))
          (accent . (telephone-line-major-mode-segment))
          (evil    . (telephone-line-airline-position-segment))))

  (setq display-time-format "%l:%M %p")

  (setq display-time-default-load-average nil)
  (setq display-time-use-mail-icon t)
  (setq display-time-mail-file t)

  (display-time-mode t)
  (telephone-line-mode 1))

(use-package yasnippet
  :hook ((prog-mode org-mode) . yas-minor-mode)
  :general
  (tyrant-def
   "y"   '(:ignore t :which-key "yasnippet")
   "yi"  'yas-insert-snippet
   "yv"  'yas-visit-snippet-file
   "yn"  'yas-new-snippet))

(use-package yasnippet-snippets
  :after yasnippet)

(use-package all-the-icons)

(use-package doom-themes)

(require 'doom-themes)

;; Global settings (defaults)
(setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
      doom-themes-enable-italic t) ; if nil, italics is universally disabled

;; Load the theme (doom-one, doom-molokai, etc); keep in mind that each theme
;; may have their own settings.
(doom-themes-org-config)

(use-package org-journal 
 :ensure t 
 :defer t
 :custom
 (org-journal-file-format "%Y.%m.%d.org"))

(define-key org-mode-map (kbd "C-c C-j") nil)

(load-theme 'manoj-dark t)

(defun switch-to-previous-buffer ()
(interactive)
(switch-to-buffer (other-buffer)))

(setq gc-cons-threshold 16777216
      gc-cons-percentage 0.1)
